; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_6 ?v2 ?v1)
             (pred_1 ?v9 ?v11)
             (pred_3 ?v2 ?v11)
             (pred_9 ?v7 ?v2 )
	     (pred_10 ?v2)
             (pred_2 ?v10)
             (pred_8 ?v9)
             (pred_12 ?v11)
             (pred_4 ?v2)
             (pred_7 ?v9)
             (pred_11 ?v2)
             (pred_5 ))



(:action op_4
:parameters (?v13 ?v4 ?v8 ?v5)
:precondition (and (pred_2 ?v13) (pred_2 ?v4) (pred_8 ?v8) (pred_12 ?v5)
          (pred_6 ?v13 ?v4) (pred_1 ?v8 ?v5)
                   (pred_3 ?v4 ?v5) (pred_10 ?v13) 
                   (pred_4 ?v4) (pred_7 ?v8))
:effect (and  (pred_11 ?v4) (not (pred_4 ?v4))))


(:action op_1
:parameters (?v13 ?v3)
:precondition (and (pred_2 ?v13) (pred_2 ?v3)
               (pred_10 ?v13) (pred_6 ?v13 ?v3) (pred_11 ?v3))
:effect (and (pred_10 ?v3) (not (pred_10 ?v13))))

(:action op_3
:parameters (?v13 ?v8)
:precondition (and (pred_2 ?v13) (pred_8 ?v8) 
                  (pred_10 ?v13) (pred_9 ?v8 ?v13) (pred_5 ))
:effect (and (pred_7 ?v8)
   (not (pred_9 ?v8 ?v13)) (not (pred_5 ))))


(:action op_5
:parameters (?v13 ?v12 ?v6)
:precondition (and (pred_2 ?v13) (pred_8 ?v12) (pred_8 ?v6)
                  (pred_10 ?v13) (pred_7 ?v6) (pred_9 ?v12 ?v13))
:effect (and (pred_7 ?v12) (pred_9 ?v6 ?v13)
        (not (pred_7 ?v6)) (not (pred_9 ?v12 ?v13))))

(:action op_2
:parameters (?v13 ?v8)
:precondition (and (pred_2 ?v13) (pred_8 ?v8) 
                  (pred_10 ?v13) (pred_7 ?v8))
:effect (and (pred_5 ) (pred_9 ?v8 ?v13) (not (pred_7 ?v8)))))

; problem
(define (problem grid-4-4-2-2-2)
    (:domain grid)
    (:objects
    obj_19 obj_16 obj_08 obj_10 obj_20 obj_15 obj_05 obj_01 obj_13 obj_11 obj_07 obj_06 obj_17 obj_12 obj_04 obj_02
    obj_03 obj_14
    obj_09 obj_18
    )

    (:init
       (pred_5)

       (pred_2 obj_19)
       (pred_2 obj_16)
       (pred_2 obj_08)
       (pred_2 obj_10)
       (pred_2 obj_20)
       (pred_2 obj_15)
       (pred_2 obj_05)
       (pred_2 obj_01)
       (pred_2 obj_13)
       (pred_2 obj_11)
       (pred_2 obj_07)
       (pred_2 obj_06)
       (pred_2 obj_17)
       (pred_2 obj_12)
       (pred_2 obj_04)
       (pred_2 obj_02)
       (pred_12 obj_03)
       (pred_12 obj_14)
       (pred_8 obj_09)
       (pred_8 obj_18)

       (pred_6 obj_19 obj_20)
       (pred_6 obj_19 obj_16)
       (pred_6 obj_16 obj_15)
       (pred_6 obj_16 obj_08)
       (pred_6 obj_16 obj_19)
       (pred_6 obj_08 obj_05)
       (pred_6 obj_08 obj_10)
       (pred_6 obj_08 obj_16)
       (pred_6 obj_10 obj_01)
       (pred_6 obj_10 obj_08)
       (pred_6 obj_20 obj_13)
       (pred_6 obj_20 obj_15)
       (pred_6 obj_20 obj_19)
       (pred_6 obj_15 obj_11)
       (pred_6 obj_15 obj_05)
       (pred_6 obj_15 obj_16)
       (pred_6 obj_15 obj_20)
       (pred_6 obj_05 obj_07)
       (pred_6 obj_05 obj_01)
       (pred_6 obj_05 obj_08)
       (pred_6 obj_05 obj_15)
       (pred_6 obj_01 obj_06)
       (pred_6 obj_01 obj_10)
       (pred_6 obj_01 obj_05)
       (pred_6 obj_13 obj_17)
       (pred_6 obj_13 obj_11)
       (pred_6 obj_13 obj_20)
       (pred_6 obj_11 obj_12)
       (pred_6 obj_11 obj_07)
       (pred_6 obj_11 obj_15)
       (pred_6 obj_11 obj_13)
       (pred_6 obj_07 obj_04)
       (pred_6 obj_07 obj_06)
       (pred_6 obj_07 obj_05)
       (pred_6 obj_07 obj_11)
       (pred_6 obj_06 obj_02)
       (pred_6 obj_06 obj_01)
       (pred_6 obj_06 obj_07)
       (pred_6 obj_17 obj_12)
       (pred_6 obj_17 obj_13)
       (pred_6 obj_12 obj_04)
       (pred_6 obj_12 obj_11)
       (pred_6 obj_12 obj_17)
       (pred_6 obj_04 obj_02)
       (pred_6 obj_04 obj_07)
       (pred_6 obj_04 obj_12)
       (pred_6 obj_02 obj_06)
       (pred_6 obj_02 obj_04)
       (pred_4 obj_16)
       (pred_4 obj_13)
       (pred_3  obj_16 obj_03)
       (pred_3  obj_13 obj_14)
       (pred_11 obj_19)
       (pred_11 obj_08)
       (pred_11 obj_10)
       (pred_11 obj_20)
       (pred_11 obj_15)
       (pred_11 obj_05)
       (pred_11 obj_01)
       (pred_11 obj_11)
       (pred_11 obj_07)
       (pred_11 obj_06)
       (pred_11 obj_17)
       (pred_11 obj_12)
       (pred_11 obj_04)
       (pred_11 obj_02)

       (pred_1  obj_09 obj_03)
       (pred_1  obj_18 obj_14)
       (pred_9 obj_09 obj_06)
       (pred_9 obj_18 obj_10)
       (pred_10 obj_17)
    )

    (:goal (and
       (pred_9 obj_09 obj_05)
    ))
(:constraints
  (always (not (pred_10 obj_07)))
)
)

; plan
1. (op_1 obj_17 obj_12)
   deleted: (pred_10 obj_17)
   added: (pred_10 obj_12)
   goals met: 0 of 1
2. (op_1 obj_12 obj_11)
   deleted: (pred_10 obj_12)
   added: (pred_10 obj_11)
   goals met: 0 of 1
3. (op_1 obj_11 obj_15)
   deleted: (pred_10 obj_11)
   added: (pred_10 obj_15)
   goals met: 0 of 1
4. (op_1 obj_15 obj_05)
   deleted: (pred_10 obj_15)
   added: (pred_10 obj_05)
   goals met: 0 of 1
5. (op_1 obj_05 obj_01)
   deleted: (pred_10 obj_05)
   added: (pred_10 obj_01)
   goals met: 0 of 1
6. (op_1 obj_01 obj_06)
   deleted: (pred_10 obj_01)
   added: (pred_10 obj_06)
   goals met: 0 of 1
7. (op_3 obj_06 obj_09)
   deleted: (pred_9 obj_09 obj_06) (pred_5)
   added: (pred_7 obj_09)
   goals met: 0 of 1
8. (op_1 obj_06 obj_01)
   deleted: (pred_10 obj_06)
   added: (pred_10 obj_01)
   goals met: 0 of 1
9. (op_1 obj_01 obj_05)
   deleted: (pred_10 obj_01)
   added: (pred_10 obj_05)
   goals met: 0 of 1
10. (op_2 obj_05 obj_09)
   deleted: (pred_7 obj_09)
   added: (pred_5) (pred_9 obj_09 obj_05)
   goals met: 1 of 1
